module.exports = {
    '/design-pattern/':[
        {
          "name": "design",
          "title": "设计模式",
          "collabsable": false,
          "children": [
            ["./dm001","【001】设计模式——单例模式"],
            ["./dm002","【002】设计模式——工厂模式"],
            ["./dm003","【003】设计模式——建造者模式"],
            ["./dm004","【004】设计模式——原型模式"],
            ["./dm005","【005】设计模式——外观设计模式"],
            ["./dm006","【006】设计模式——适配器设计模式"],
            ["./dm007","【007】设计模式——代理模式"],
            ["./dm008","【008】设计模式——装饰者模式"],
            ["./dm009","【009】设计模式——桥接模式"],
            ["./dm010","【010】设计模式——组合模式"],
          ]
        },
      ]
  }
  
  