module.exports = {
  '/typescript/':[
      // ['','目录'],
      {
        "name": "Typescript",
        "title": "Typescript",
        "collabsable": true,
        "children": [
          ["", "目录"],
          ["ts001","【001】数据类型"],
          ["ts002","【002】函数"],
          ["ts003","【003】接口"],
          ["ts004","【004】类"],
          ["ts005","【005】泛型"],
          ["ts006","【006】枚举"],
          ["ts007","【007】类型推论"],
          ["ts008","【008】高级类型"],
          ["ts009","【009】装饰器"],
          ["ts010","【010】tsconfig配置文件"],
        ]
      }
    ]
}

